Repository: humblefoundation-zz/translation-support-files
Catalog: quran-imported/Yusuf Ali.tmx
Source language: ar
Languages: en

source: يوم يقوم الروح والملائكة صفا لا يتكلمون إلا من أذن له الرحمن وقال صوابا
en: The Day that the Spirit and the angels will stand forth in ranks, none shall speak except any who is permitted by (Allah) Most Gracious, and He will say what is right.

source: ذلك اليوم الحق فمن شاء اتخذ إلى ربه مآبا
en: That Day will be the sure Reality: Therefore, whoso will, let him take a (straight) return to his Lord!

source: إنا أنذرناكم عذابا قريبا يوم ينظر المرء ما قدمت يداه ويقول الكافر يا ليتني كنت ترابا
en: Verily, We have warned you of a Penalty near, the Day when man will see (the deeds) which his hands have sent forth, and the Unbeliever will say, "Woe unto me! Would that I were (metre) dust!"

source: والنازعات غرقا
en: By the (angels) who tear out (the souls of the wicked) with violence;

source: والناشطات نشطا
en: By those who gently draw out (the souls of the blessed);

source: والسابحات سبحا
en: And by those who glide along (on errands of mercy),

source: فالسابقات سبقا
en: Then press forward as in a race,

source: فالمدبرات أمرا
en: Then arrange to do (the Commands of their Lord),

source: يوم ترجف الراجفة
en: One Day everything that can be in commotion will be in violent commotion,

source: تتبعها الرادفة
en: Followed by oft-repeated (commotions):

source: قلوب يومئذ واجفة
en: Hearts that Day will be in agitation;

source: أبصارها خاشعة
en: Cast down will be (their owners') eyes.

source: يقولون أإنا لمردودون في الحافرة
en: They say (now): "What! shall we indeed be returned to (our) former state?

source: أإذا كنا عظاما نخرة
en: "What! - when we shall have become rotten bones?"

source: قالوا تلك إذا كرة خاسرة
en: They say: "It would, in that case, be a return with loss!"

source: فإنما هي زجرة واحدة
en: But verily, it will be but a single (Compelling) Cry,

source: فإذا هم بالساهرة
en: When, behold, they will be in the (full) awakening (to Judgment).

source: هل أتاك حديث موسى
en: Has the story of Moses reached thee?

source: إذ ناداه ربه بالواد المقدس طوى
en: Behold, thy Lord did call to him in the sacred valley of Tuwa:-

source: فقل هل لك إلى أن تزكى
en: "And say to him, 'Wouldst thou that thou shouldst be purified (from sin)?-

source: وأهديك إلى ربك فتخشى
en: "'And that I guide thee to thy Lord, so thou shouldst fear Him?'"

source: فأراه الآية الكبرى
en: Then did (Moses) show him the Great Sign.

source: فكذب وعصى
en: But (Pharaoh) rejected it and disobeyed (guidance);

source: ثم أدبر يسعى
en: Further, he turned his back, striving hard (against Allah).

source: فحشر فنادى
en: Then he collected (his men) and made a proclamation,

source: فقال أنا ربكم الأعلى
en: Saying, "I am your Lord, Most High".

source: فأخذه الله نكال الآخرة والأولى
en: But Allah did punish him, (and made an) example of him, - in the Hereafter, as in this life.

source: إن في ذلك لعبرة لمن يخشى
en: Verily in this is an instructive warning for whosoever feareth (Allah).

source: أأنتم أشد خلقا أم السماء بناها
en: What! Are ye the more difficult to create or the heaven (above)? (Allah) hath constructed it:

source: رفع سمكها فسواها
en: On high hath He raised its canopy, and He hath given it order and perfection.

source: وأغطش ليلها وأخرج ضحاها
en: Its night doth He endow with darkness, and its splendour doth He bring out (with light).

source: والأرض بعد ذلك دحاها
en: And the earth, moreover, hath He extended (to a wide expanse);

source: أخرج منها ماءها ومرعاها
en: He draweth out therefrom its moisture and its pasture;

source: والجبال أرساها
en: And the mountains hath He firmly fixed;-

source: متاعا لكم ولأنعامكم
en: For use and convenience to you and your cattle.

source: فإذا جاءت الطامة الكبرى
en: Therefore, when there comes the great, overwhelming (Event),-

source: يوم يتذكر الإنسان ما سعى
en: The Day when man shall remember (all) that he strove for,

source: وبرزت الجحيم لمن يرى
en: And Hell-Fire shall be placed in full view for (all) to see,-

source: فأما من طغى
en: Then, for such as had transgressed all bounds,

source: وآثر الحياة الدنيا
en: And had preferred the life of this world,

source: فإن الجحيم هي المأوى
en: The Abode will be Hell-Fire;

source: وأما من خاف مقام ربه ونهى النفس عن الهوى
en: And for such as had entertained the fear of standing before their Lord's (tribunal) and had restrained (their) soul from lower desires,

source: فإن الجنة هي المأوى
en: Their abode will be the Garden.

source: يسألونك عن الساعة أيان مرساها
en: They ask thee about the Hour,-'When will be its appointed time?

source: فيم أنت من ذكراها
en: Wherein art thou (concerned) with the declaration thereof?

source: إلى ربك منتهاها
en: With thy Lord in the Limit fixed therefor.

source: إنما أنت منذر من يخشاها
en: Thou art but a Warner for such as fear it.

source: كأنهم يوم يرونها لم يلبثوا إلا عشية أو ضحاها
en: The Day they see it, (It will be) as if they had tarried but a single evening, or (at most till) the following morn!

source: عبس وتولى
en: (The Prophet) frowned and turned away,

source: أن جاءه الأعمى
en: Because there came to him the blind man (interrupting).

source: وما يدريك لعله يزكى
en: But what could tell thee but that perchance he might grow (in spiritual understanding)?-

source: أو يذكر فتنفعه الذكرى
en: Or that he might receive admonition, and the teaching might profit him?

source: أما من استغنى
en: As to one who regards Himself as self-sufficient,

source: فأنت له تصدى
en: To him dost thou attend;

source: وما عليك ألا يزكى
en: Though it is no blame to thee if he grow not (in spiritual understanding).

source: وأما من جاءك يسعى
en: But as to him who came to thee striving earnestly,

source: وهو يخشى
en: And with fear (in his heart),

source: فأنت عنه تلهى
en: Of him wast thou unmindful.

source: كلا إنها تذكرة
en: By no means (should it be so)! For it is indeed a Message of instruction:

source: في صحف مكرمة
en: (It is) in Books held (greatly) in honour,

source: مرفوعة مطهرة
en: Exalted (in dignity), kept pure and holy,

source: بأيدي سفرة
en: (Written) by the hands of scribes-

source: كرام بررة
en: Honourable and Pious and Just.

source: قتل الإنسان ما أكفره
en: Woe to man! What hath made him reject Allah;

source: من أي شيء خلقه
en: From what stuff hath He created him?

source: من نطفة خلقه فقدره
en: From a sperm-drop: He hath created him, and then mouldeth him in due proportions;

source: ثم السبيل يسره
en: Then doth He make His path smooth for him;

source: ثم أماته فأقبره
en: Then He causeth him to die, and putteth him in his grave;

source: ثم إذا شاء أنشره
en: Then, when it is His Will, He will raise him up (again).

source: كلا لما يقض ما أمره
en: By no means hath he fulfilled what Allah hath commanded him.

source: فلينظر الإنسان إلى طعامه
en: Then let man look at his food, (and how We provide it):

source: أنا صببنا الماء صبا
en: For that We pour forth water in abundance,

source: ثم شققنا الأرض شقا
en: And We split the earth in fragments,

source: فأنبتنا فيها حبا
en: And produce therein corn,

source: وعنبا وقضبا
en: And Grapes and nutritious plants,

source: وزيتونا ونخلا
en: And Olives and Dates,

source: وحدائق غلبا
en: And enclosed Gardens, dense with lofty trees,

source: وفاكهة وأبا
en: And fruits and fodder,-

source: فإذا جاءت الصاخة
en: At length, when there comes the Deafening Noise,-

source: يوم يفر المرء من أخيه
en: That Day shall a man flee from his own brother,

source: وأمه وأبيه
en: And from his mother and his father,

source: وصاحبته وبنيه
en: And from his wife and his children.

source: لكل امرئ منهم يومئذ شأن يغنيه
en: Each one of them, that Day, will have enough concern (of his own) to make him indifferent to the others.

source: وجوه يومئذ مسفرة
en: Some faces that Day will be beaming,

source: ضاحكة مستبشرة
en: Laughing, rejoicing.

source: ووجوه يومئذ عليها غبرة
en: And other faces that Day will be dust-stained,

source: ترهقها قترة
en: Blackness will cover them:

source: أولئك هم الكفرة الفجرة
en: Such will be the Rejecters of Allah, the doers of iniquity.

source: إذا الشمس كورت
en: When the sun (with its spacious light) is folded up;

source: وإذا النجوم انكدرت
en: When the stars fall, losing their lustre;

source: وإذا الجبال سيرت
en: When the mountains vanish (like a mirage);

source: وإذا العشار عطلت
en: When the she-camels, ten months with young, are left untended;

source: وإذا الوحوش حشرت
en: When the wild beasts are herded together (in the human habitations);

source: وإذا البحار سجرت
en: When the oceans boil over with a swell;

source: وإذا النفوس زوجت
en: When the souls are sorted out, (being joined, like with like);

source: وإذا الموءودة سئلت
en: When the female (infant), buried alive, is questioned -

source: بأي ذنب قتلت
en: For what crime she was killed;

source: وإذا الصحف نشرت
en: When the scrolls are laid open;

source: وإذا السماء كشطت
en: When the world on High is unveiled;

source: وإذا الجحيم سعرت
en: When the Blazing Fire is kindled to fierce heat;

source: وإذا الجنة أزلفت
en: And when the Garden is brought near;-

source: علمت نفس ما أحضرت
en: (Then) shall each soul know what it has put forward.

source: فلا أقسم بالخنس
en: So verily I call to witness the planets - that recede,

source: الجوار الكنس
en: Go straight, or hide;

source: والليل إذا عسعس
en: And the Night as it dissipates;

source: والصبح إذا تنفس
en: And the Dawn as it breathes away the darkness;-

source: ذي قوة عند ذي العرش مكين
en: Endued with Power, with rank before the Lord of the Throne,

source: مطاع ثم أمين
en: With authority there, (and) faithful to his trust.

source: وما صاحبكم بمجنون
en: And (O people!) your companion is not one possessed;

source: ولقد رآه بالأفق المبين
en: And without doubt he saw him in the clear horizon.

source: وما هو على الغيب بضنين
en: Neither doth he withhold grudgingly a knowledge of the Unseen.

source: وما هو بقول شيطان رجيم
en: Nor is it the word of an evil spirit accursed.

source: فأين تذهبون
en: When whither go ye?

source: لمن شاء منكم أن يستقيم
en: (With profit) to whoever among you wills to go straight:

source: وما تشاءون إلا أن يشاء الله رب العالمين
en: But ye shall not will except as Allah wills,- the Cherisher of the Worlds.

source: إذا السماء انفطرت
en: When the Sky is cleft asunder;

source: وإذا الكواكب انتثرت
en: When the Stars are scattered;

source: وإذا البحار فجرت
en: When the Oceans are suffered to burst forth;

source: وإذا القبور بعثرت
en: And when the Graves are turned upside down;-

source: علمت نفس ما قدمت وأخرت
en: (Then) shall each soul know what it hath sent forward and (what it hath) kept back.

source: يا أيها الإنسان ما غرك بربك الكريم
en: O man! What has seduced thee from thy Lord Most Beneficent?-

source: الذي خلقك فسواك فعدلك
en: Him Who created thee. Fashioned thee in due proportion, and gave thee a just bias;

source: في أي صورة ما شاء ركبك
en: In whatever Form He wills, does He put thee together.

source: كلا بل تكذبون بالدين
en: Nay! But ye do reject Right and Judgment!

source: وإن عليكم لحافظين
en: But verily over you (are appointed angels) to protect you,-

source: كراما كاتبين
en: Kind and honourable,- Writing down (your deeds):

source: يعلمون ما تفعلون
en: They know (and understand) all that ye do.

source: إن الأبرار لفي نعيم
en: As for the Righteous, they will be in bliss;

source: وإن الفجار لفي جحيم
en: And the Wicked - they will be in the Fire,

source: يصلونها يوم الدين
en: Which they will enter on the Day of Judgment,

source: وما هم عنها بغائبين
en: And they will not be able to keep away therefrom.

source: وما أدراك ما يوم الدين
en: And what will explain to thee what the Day of Judgment is?

source: ثم ما أدراك ما يوم الدين
en: Again, what will explain to thee what the Day of Judgment is?

source: يوم لا تملك نفس لنفس شيئا والأمر يومئذ لله
en: (It will be) the Day when no soul shall have power (to do) aught for another: For the command, that Day, will be (wholly) with Allah.

source: ويل للمطففين
en: Woe to those that deal in fraud,-

source: الذين إذا اكتالوا على الناس يستوفون
en: Those who, when they have to receive by measure from men, exact full measure,

source: وإذا كالوهم أو وزنوهم يخسرون
en: But when they have to give by measure or weight to men, give less than due.

source: ألا يظن أولئك أنهم مبعوثون
en: Do they not think that they will be called to account?-

source: ليوم عظيم
en: On a Mighty Day,

source: يوم يقوم الناس لرب العالمين
en: A Day when (all) mankind will stand before the Lord of the Worlds?

source: كلا إن كتاب الفجار لفي سجين
en: Nay! Surely the record of the wicked is (preserved) in Sijjin.

source: وما أدراك ما سجين
en: And what will explain to thee what Sijjin is?

source: كتاب مرقوم
en: (There is) a Register (fully) inscribed.

source: الذين يكذبون بيوم الدين
en: Those that deny the Day of Judgment.

source: وما يكذب به إلا كل معتد أثيم
en: And none can deny it but the Transgressor beyond bounds the Sinner!

source: كلا بل ران على قلوبهم ما كانوا يكسبون
en: By no means! but on their hearts is the stain of the (ill) which they do!

source: كلا إنهم عن ربهم يومئذ لمحجوبون
en: Verily, from (the Light of) their Lord, that Day, will they be veiled.

source: ثم إنهم لصالو الجحيم
en: Further, they will enter the Fire of Hell.

source: ثم يقال هذا الذي كنتم به تكذبون
en: Further, it will be said to them: "This is the (reality) which ye rejected as false!

source: كلا إن كتاب الأبرار لفي عليين
en: Nay, verily the record of the Righteous is (preserved) in 'Illiyin.

source: وما أدراك ما عليون
en: And what will explain to thee what 'Illiyun is?

source: يشهده المقربون
en: To which bear witness those Nearest (to Allah).

source: على الأرائك ينظرون
en: On Thrones (of Dignity) will they command a sight (of all things):

source: تعرف في وجوههم نضرة النعيم
en: Thou wilt recognise in their faces the beaming brightness of Bliss.

source: يسقون من رحيق مختوم
en: Their thirst will be slaked with Pure Wine sealed:

source: ختامه مسك وفي ذلك فليتنافس المتنافسون
en: The seal thereof will be Musk: And for this let those aspire, who have aspirations:

source: ومزاجه من تسنيم
en: With it will be (given) a mixture of Tasnim:

source: عينا يشرب بها المقربون
en: A spring, from (the waters) whereof drink those Nearest to Allah.

source: إن الذين أجرموا كانوا من الذين آمنوا يضحكون
en: Those in sin used to laugh at those who believed,

source: وإذا مروا بهم يتغامزون
en: And whenever they passed by them, used to wink at each other (in mockery);

source: وإذا انقلبوا إلى أهلهم انقلبوا فكهين
en: And when they returned to their own people, they would return jesting;

source: وإذا رأوهم قالوا إن هؤلاء لضالون
en: And whenever they saw them, they would say, "Behold! These are the people truly astray!"

source: وما أرسلوا عليهم حافظين
en: But they had not been sent as keepers over them!

source: فاليوم الذين آمنوا من الكفار يضحكون
en: But on this Day the Believers will laugh at the Unbelievers:

source: هل ثوب الكفار ما كانوا يفعلون
en: Will not the Unbelievers have been paid back for what they did?

source: إذا السماء انشقت
en: When the sky is rent asunder,

source: وأذنت لربها وحقت
en: And hearkens to (the Command of) its Lord, and it must needs (do so);-

source: وإذا الأرض مدت
en: And when the earth is flattened out,

source: وألقت ما فيها وتخلت
en: And casts forth what is within it and becomes (clean) empty,

source: يا أيها الإنسان إنك كادح إلى ربك كدحا فملاقيه
en: O thou man! Verily thou art ever toiling on towards thy Lord- painfully toiling,- but thou shalt meet Him.

source: فأما من أوتي كتابه بيمينه
en: Then he who is given his Record in his right hand,

source: فسوف يحاسب حسابا يسيرا
en: Soon will his account be taken by an easy reckoning,

source: وينقلب إلى أهله مسرورا
en: And he will turn to his people, rejoicing!

source: وأما من أوتي كتابه وراء ظهره
en: But he who is given his Record behind his back,-

source: فسوف يدعو ثبورا
en: Soon will he cry for perdition,

source: ويصلى سعيرا
en: And he will enter a Blazing Fire.

source: إنه كان في أهله مسرورا
en: Truly, did he go about among his people, rejoicing!

source: إنه ظن أن لن يحور
en: Truly, did he think that he would not have to return (to Us)!

source: بلى إن ربه كان به بصيرا
en: Nay, nay! for his Lord was (ever) watchful of him!

source: فلا أقسم بالشفق
en: So I do call to witness the ruddy glow of Sunset;

source: والليل وما وسق
en: The Night and its Homing;

source: والقمر إذا اتسق
en: And the Moon in her fullness:

source: لتركبن طبقا عن طبق
en: Ye shall surely travel from stage to stage.

source: فما لهم لا يؤمنون
en: What then is the matter with them, that they believe not?-

source: وإذا قرئ عليهم القرآن لا يسجدون
en: And when the Qur'an is read to them, they fall not prostrate,

source: بل الذين كفروا يكذبون
en: But on the contrary the Unbelievers reject (it).

source: والله أعلم بما يوعون
en: But Allah has full knowledge of what they secrete (in their breasts)

source: فبشرهم بعذاب أليم
en: So announce to them a Penalty Grievous,

source: إلا الذين آمنوا وعملوا الصالحات لهم أجر غير ممنون
en: Except to those who believe and work righteous deeds: For them is a Reward that will never fail.

source: والسماء ذات البروج
en: By the sky, (displaying) the Zodiacal Signs;

source: واليوم الموعود
en: By the promised Day (of Judgment);

source: وشاهد ومشهود
en: By one that witnesses, and the subject of the witness;-

source: قتل أصحاب الأخدود
en: Woe to the makers of the pit (of fire),

source: النار ذات الوقود
en: Fire supplied (abundantly) with fuel:

source: إذ هم عليها قعود
en: Behold! they sat over against the (fire),

source: وهم على ما يفعلون بالمؤمنين شهود
en: And they witnessed (all) that they were doing against the Believers.

source: وما نقموا منهم إلا أن يؤمنوا بالله العزيز الحميد
en: And they ill-treated them for no other reason than that they believed in Allah, Exalted in Power, Worthy of all Praise!-

source: الذي له ملك السماوات والأرض والله على كل شيء شهيد
en: Him to Whom belongs the dominion of the heavens and the earth! And Allah is Witness to all things.

source: إن الذين فتنوا المؤمنين والمؤمنات ثم لم يتوبوا فلهم عذاب جهنم ولهم عذاب الحريق
en: Those who persecute (or draw into temptation) the Believers, men and women, and do not turn in repentance, will have the Penalty of Hell: They will have the Penalty of the Burning Fire.

source: إن الذين آمنوا وعملوا الصالحات لهم جنات تجري من تحتها الأنهار ذلك الفوز الكبير
en: For those who believe and do righteous deeds, will be Gardens; beneath which rivers flow: That is the great Salvation, (the fulfilment of all desires),

source: إن بطش ربك لشديد
en: Truly strong is the Grip (and Power) of thy Lord.

source: إنه هو يبدئ ويعيد
en: It is He Who creates from the very beginning, and He can restore (life).

source: وهو الغفور الودود
en: And He is the Oft-Forgiving, Full of Loving-Kindness,

source: ذو العرش المجيد
en: Lord of the Throne of Glory,

source: فعال لما يريد
en: Doer (without let) of all that He intends.

source: هل أتاك حديث الجنود
en: Has the story reached thee, of the forces-

source: فرعون وثمود
en: Of Pharaoh and the Thamud?

source: بل الذين كفروا في تكذيب
en: And yet the Unbelievers (persist) in rejecting (the Truth)!

source: والله من ورائهم محيط
en: But Allah doth encompass them from behind!

source: بل هو قرآن مجيد
en: Nay, this is a Glorious Qur'an,

source: في لوح محفوظ
en: (Inscribed) in a Tablet Preserved!

source: والسماء والطارق
en: By the Sky and the Night-Visitant (therein);-

source: وما أدراك ما الطارق
en: And what will explain to thee what the Night-Visitant is?-

source: النجم الثاقب
en: (It is) the Star of piercing brightness;-

source: إن كل نفس لما عليها حافظ
en: There is no soul but has a protector over it.

source: فلينظر الإنسان مم خلق
en: Now let man but think from what he is created!

source: خلق من ماء دافق
en: He is created from a drop emitted-

source: يخرج من بين الصلب والترائب
en: Proceeding from between the backbone and the ribs:

source: إنه على رجعه لقادر
en: Surely (Allah) is able to bring him back (to life)!

source: يوم تبلى السرائر
en: The Day that (all) things secret will be tested,

source: فما له من قوة ولا ناصر
en: (Man) will have no power, and no helper.

source: والسماء ذات الرجع
en: By the Firmament which returns (in its round),

source: والأرض ذات الصدع
en: And by the Earth which opens out (for the gushing of springs or the sprouting of vegetation),-

source: إنه لقول فصل
en: Behold this is the Word that distinguishes (Good from Evil):

source: وما هو بالهزل
en: It is not a thing for amusement.

source: إنهم يكيدون كيدا
en: As for them, they are but plotting a scheme,

source: وأكيد كيدا
en: And I am planning a scheme.

source: فمهل الكافرين أمهلهم رويدا
en: Therefore grant a delay to the Unbelievers: Give respite to them gently (for awhile).

source: سبح اسم ربك الأعلى
en: Glorify the name of thy Guardian-Lord Most High,

source: الذي خلق فسوى
en: Who hath created, and further, given order and proportion;

source: والذي قدر فهدى
en: Who hath ordained laws. And granted guidance;

source: والذي أخرج المرعى
en: And Who bringeth out the (green and luscious) pasture,

source: فجعله غثاء أحوى
en: And then doth make it (but) swarthy stubble.

source: سنقرئك فلا تنسى
en: By degrees shall We teach thee to declare (the Message), so thou shalt not forget,

source: إلا ما شاء الله إنه يعلم الجهر وما يخفى
en: Except as Allah wills: For He knoweth what is manifest and what is hidden.

source: ونيسرك لليسرى
en: And We will make it easy for thee (to follow) the simple (Path).

source: فذكر إن نفعت الذكرى
en: Therefore give admonition in case the admonition profits (the hearer).

source: سيذكر من يخشى
en: The admonition will be received by those who fear (Allah):

source: ويتجنبها الأشقى
en: But it will be avoided by those most unfortunate ones,

source: الذي يصلى النار الكبرى
en: Who will enter the Great Fire,

source: ثم لا يموت فيها ولا يحيى
en: In which they will then neither die nor live.

source: قد أفلح من تزكى
en: But those will prosper who purify themselves,

source: وذكر اسم ربه فصلى
en: And glorify the name of their Guardian-Lord, and (lift their hearts) in prayer.

source: بل تؤثرون الحياة الدنيا
en: Nay (behold), ye prefer the life of this world;

source: والآخرة خير وأبقى
en: But the Hereafter is better and more enduring.

source: إن هذا لفي الصحف الأولى
en: And this is in the Books of the earliest (Revelation),-

source: صحف إبراهيم وموسى
en: The Books of Abraham and Moses.

source: هل أتاك حديث الغاشية
en: Has the story reached thee of the overwhelming (Event)?

source: وجوه يومئذ خاشعة
en: Some faces, that Day, will be humiliated,

source: عاملة ناصبة
en: Labouring (hard), weary,-

source: تصلى نارا حامية
en: The while they enter the Blazing Fire,-

source: تسقى من عين آنية
en: The while they are given, to drink, of a boiling hot spring,

source: ليس لهم طعام إلا من ضريع
en: No food will there be for them but a bitter Dhari'

source: لا يسمن ولا يغني من جوع
en: Which will neither nourish nor satisfy hunger.

source: وجوه يومئذ ناعمة
en: (Other) faces that Day will be joyful,

source: لسعيها راضية
en: Pleased with their striving,-

source: لا تسمع فيها لاغية
en: Where they shall hear no (word) of vanity:

source: فيها عين جارية
en: Therein will be a bubbling spring:

source: فيها سرر مرفوعة
en: Therein will be Thrones (of dignity), raised on high,

source: وأكواب موضوعة
en: Goblets placed (ready),

source: ونمارق مصفوفة
en: And cushions set in rows,

source: وزرابي مبثوثة
en: And rich carpets (all) spread out.

source: أفلا ينظرون إلى الإبل كيف خلقت
en: Do they not look at the Camels, how they are made?-

source: وإلى السماء كيف رفعت
en: And at the Sky, how it is raised high?-

source: وإلى الجبال كيف نصبت
en: And at the Mountains, how they are fixed firm?-

source: وإلى الأرض كيف سطحت
en: And at the Earth, how it is spread out?

source: فذكر إنما أنت مذكر
en: Therefore do thou give admonition, for thou art one to admonish.

source: لست عليهم بمصيطر
en: Thou art not one to manage (men's) affairs.
